In [35]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [36]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [37]:
%sql sqlite:///my_data1.db

In [38]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [39]:
%%sql
SELECT * 
FROM SPACEXTBL
LIMIT 1

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)')]

###  1. Display the names of the unique launch sites in the space mission

In [40]:
%%sql
SELECT DISTINCT(Launch_Site)
FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

### 2. Display 5 records where launch sites begin with the string 'CCA'Â¶

In [41]:
%%sql
SELECT Launch_Site
FROM SPACEXTBL
WHERE Launch_Site LIKE 'CCA%'
LIMIT 5

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',)]

### 3. Display the total payload mass carried by boosters launched by NASA (CRS)

In [42]:
%%sql 
SELECT COUNT(PAYLOAD_MASS__KG_)
FROM SPACEXTBL
WHERE CUSTOMER = 'NASA(CRS)'

 * sqlite:///my_data1.db
Done.

[(0,)]

### 4. Display average payload mass carried by booster version F9 v1.1

In [47]:
%%sql 
SELECT AVG(PAYLOAD_MASS__KG_)
FROM SPACEXTBL
WHERE Booster_Version = 'F9 v1.1'

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### 5. List the date when the first succesful landing outcome in ground pad was acheived.

In [54]:
%%sql
SELECT MIN(DATE)
FROM SPACEXTBL
WHERE Landing_Outcome == "Success (ground pad)"

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

### 6. List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [57]:
%%sql
SELECT DISTINCT(Landing_Outcome)
FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('Failure (parachute)',),
 ('No attempt',),
 ('Uncontrolled (ocean)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Precluded (drone ship)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',)]

In [59]:
%%sql
SELECT Booster_Version AS NAME_BOOSTER
FROM SPACEXTBL 
WHERE Landing_Outcome == "Success (drone ship)" AND PAYLOAD_MASS__KG_ > 400 AND PAYLOAD_MASS__KG_ < 6000

 * sqlite:///my_data1.db
Done.

[('F9 FT B1021.1',),
 ('F9 FT B1022',),
 ('F9 FT B1023.1',),
 ('F9 FT B1026',),
 ('F9 FT  B1021.2',),
 ('F9 FT  B1029.2',),
 ('F9 FT B1038.1',),
 ('F9 FT  B1031.2',),
 ('F9 B4 B1042.1',),
 ('F9 B5  B1046.1',)]

### 7. List the total number of successful and failure mission outcomes

In [66]:
%%sql
SELECT COUNT(Mission_Outcome) AS TOTAL_SUCCESSFUL_OUTCOME
FROM SPACEXTBL 
WHERE Mission_Outcome LIKE "Success%";

 * sqlite:///my_data1.db
Done.

[(100,)]

In [65]:
%%sql
SELECT COUNT(Mission_Outcome) AS TOTAL_FAILURE_OUTCOME
FROM SPACEXTBL 
WHERE Mission_Outcome LIKE "FAILURE%" ;

 * sqlite:///my_data1.db
Done.

[(1,)]

### 8. List the names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [67]:
%%sql
SELECT Booster_Version AS NAMES_OF_Booster_Version
FROM SPACEXTBL
WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTBL)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### 9. List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

In [69]:
%%sql
SELECT SUBSTR(DATE,6,2), Landing_Outcome, Booster_Version, Launch_Site
FROM SPACEXTBL 
WHERE Landing_Outcome ="Failure (drone ship)" AND SUBSTR(DATE,0,5) = '2015'

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### 10. Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [74]:
%%sql
SELECT Landing_Outcome,COUNT(Landing_Outcome)
FROM SPACEXTBL 
WHERE (Landing_Outcome = "Failure (drone ship)") OR (Landing_Outcome = "Success (ground pad)") AND (DATE BETWEEN '2010-06-04' AND '2017-03-20')
GROUP BY Landing_Outcome
ORDER BY DATE

 * sqlite:///my_data1.db
Done.

[('Failure (drone ship)', 5), ('Success (ground pad)', 3)]